Config/Catalogs/СубъектыРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СубъектыРФ</Name>
			<Comment>Субъекты Российской Федерации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДляНалогов</Name>
					<Comment>Код для налоговых отчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФедеральныйОкруг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФедеральныеОкруга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/СубъектыРФ/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполнение справочника СубъектыРФ на основании макета справочника
//
Процедура ЗагрузитьЭлементы() Экспорт 
	
	// Сначала обновим список федеральных округов
	Справочники.ФедеральныеОкруга.ЗагрузитьЭлементы();
	
	Макет = ПолучитьМакет("СубъектыРФ");
	
	ОбластьКод 					= Макет.ПолучитьОбласть("Код");
	ОбластьНаименование 		= Макет.ПолучитьОбласть("Наименование");
	ОбластьФедеральныйОкруг 	= Макет.ПолучитьОбласть("ФедеральныйОкруг");
	ОбластьКодОКАТО 			= Макет.ПолучитьОбласть("КодОКАТО");
	ОбластьКодДляНалогов 		= Макет.ПолучитьОбласть("КодДляНалогов");
	
	н = 1;
	
	Пока (Истина) Цикл
		
		ТекКод = СокрЛП(ОбластьКод.Область(н, 1).Текст);
		
		Если НЕ ЗначениеЗаполнено(ТекКод) Тогда
			Прервать;
		КонецЕсли;
		
		ТекНаименование = СокрЛП(ОбластьНаименование.Область(н, 1).Текст);
		
		ТекФедеральныйОкругСтрока = СокрЛП(ОбластьФедеральныйОкруг.Область(н, 1).Текст);
		ТекФедеральныйОкругСсылка = Справочники.ФедеральныеОкруга.НайтиПоНаименованию(
			ТекФедеральныйОкругСтрока);
					
		ТекКодОКАТО 		= СокрЛП(ОбластьКодОКАТО.Область(н, 1).Текст);
		ТекКодДляНалогов 	= СокрЛП(ОбластьКодДляНалогов.Область(н, 1).Текст);
		
		ТекСсылка = НайтиПоКоду(ТекКод);
		
		Если Не ТекСсылка.Пустая() Тогда
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
		Иначе
			ТекОбъект = СоздатьЭлемент();
			ТекОбъект.Код = ТекКод;
		КонецЕсли;
		
		ТекОбъект.Наименование 		= ТекНаименование;
		ТекОбъект.ФедеральныйОкруг 	= ТекФедеральныйОкругСсылка;
		ТекОбъект.КодОКАТО 			= ТекКодОКАТО;
		ТекОбъект.КодДляНалогов 	= ТекКодДляНалогов;
		
		ТекОбъект.Записать();
		
		н = н + 1;
		
	КонецЦикла;
	
КонецПроцедуры
